mark-nick-o/PIC32RobotCameraDroneController/io.h
#ifndef  __io__
#define  __io__

#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus */

//    io.h : PIC32 input / output / port definitions
//
//    Version : @(#) 1.0
//    Copyright (C) 2020 A C P Avaiation Walkerburn Scotland
//
// Set up the IO PORTS for analogue input (AIN) digital input (DIN) and LED output (DOT)

/* -------- Interrupt Vector Table definition -------------------------------
   IPC0,12 are the interrupt priority SFRs
   IEC0,1,2 are 32 bit configurations to set the interrupts
   IFS0,1,2 are 32 bit representations of there state triggers */

#define COMPARE0_ENAB (1u<<0u)
#define INT0_ENAB (1u<<3u)
#define INT1_ENAB (1u<<7u)
#define INT2_ENAB (1u<<11u)
#define INT3_ENAB (1u<<15u)
#define INT4_ENAB (1u<<19u)
#define CN_ENAB (1u<<0u)

#define PRIO_COMPARE_MASK ~(0x0000001FUL << 0u)                                 /* set the mask to remove the bits before we set them according to prio and sub-prio */
#define SET_PRIO_COMPARE0_INTER(prio,subprio) do{ if((prio<=7u)&&(subprio<=3u)) {IPC0=(((IPC0 & PRIO_COMPARE_MASK) | (prio<<2u)) | (subprio)); IEC0=(IEC0 | COMPARE0_ENAB); IFS0=(IFS0 & ~COMPARE0_ENAB); } }while(0)
#define CLR_PRIO_COMPARE0_INTER(prio,subprio) do{ IEC0=(IEC0 & ~(COMPARE0_ENAB)); IFS0=(IFS0 & ~COMPARE0_ENAB); } }while(0)

#define PRIO_CN_MASK ~(0x0000001FUL << 16u)                                     /* set the mask to remove the bits before we set them according to prio and sub-prio */
#define SET_PRIO_CN_INTER(prio,subprio) do{ if((prio<=7u)&&(subprio<=3u)) {asm di; IPC6=(((IPC6 & PRIO_CN_MASK) | (prio<<18u)) | (subprio<<16u)); IEC1=(IEC1 | CN_ENAB); IFS1=(IFS1 & ~CN_ENAB); asm ei; } }while(0)
#define CLR_PRIO_CN_INTER(prio,subprio) do{ asm di; IEC1=(IEC1 & ~(CN_ENAB)); IFS1=(IFS1 & ~CN_ENAB); asm ei; } }while(0)

#define PRIO_IO_MASK ~(0x0000001FUL << 24u)
#define SET_PRIO_IO0_INTER(prio,subprio) do{ if((prio<=7u)&&(subprio<=3u)) {IPC0=(((IPC0 & PRIO_IO_MASK) | (prio<<26u)) | (subprio<<24u)); IEC0=(IEC0 | INT0_ENAB); IFS0=(IFS0 & ~INT0_ENAB); } }while(0)
#define CLR_PRIO_IO0_INTER(prio,subprio) do{ IEC0=(IEC0 & ~(INT0_ENAB)); IFS0=(IFS0 & ~INT0_ENAB); }while(0)
#define SET_PRIO_IO1_INTER(prio,subprio) do{ if((prio<=7u)&&(subprio<=3u)) {IPC1=(((IPC1 & PRIO_IO_MASK) | (prio<<26u)) | (subprio<<24u)); IEC0=(IEC0 | INT1_ENAB); IFS0=(IFS0 & ~INT1_ENAB); } }while(0)
#define CLR_PRIO_IO1_INTER(prio,subprio) do{ IEC0=(IEC0 & ~(INT0_ENAB)); IFS0=(IFS0 & ~INT1_ENAB); }while(0)
#define SET_PRIO_IO2_INTER(prio,subprio) do{ if((prio<=7u)&&(subprio<=3u)) {IPC2=(((IPC2 & PRIO_IO_MASK) | (prio<<26u)) | (subprio<<24u)); IEC0=(IEC0 | INT2_ENAB); IFS0=(IFS0 & ~INT2_ENAB); } }while(0)
#define CLR_PRIO_IO2_INTER(prio,subprio) do{ IEC0=(IEC0 & ~(INT0_ENAB)); IFS0=(IFS0 & ~INT2_ENAB); }while(0)
#define SET_PRIO_IO3_INTER(prio,subprio) do{ if((prio<=7u)&&(subprio<=3u)) {IPC3=(((IPC3 & PRIO_IO_MASK) | (prio<<26u)) | (subprio<<24u)); IEC0=(IEC0 | INT3_ENAB); IFS0=(IFS0 & ~INT3_ENAB); } }while(0)
#define CLR_PRIO_IO3_INTER(prio,subprio) do{ IEC0=(IEC0 & ~(INT0_ENAB)); IFS0=(IFS0 & ~INT3_ENAB); }while(0)
#define SET_PRIO_IO4_INTER(prio,subprio) do{ if((prio<=7u)&&(subprio<=3u)) {IPC4=(((IPC4 & PRIO_IO_MASK) | (prio<<26u)) | (subprio<<24u)); IEC0=(IEC0 | INT4_ENAB); IFS0=(IFS0 & ~INT4_ENAB); } }while(0)
#define CLR_PRIO_IO4_INTER(prio,subprio) do{ IEC0=(IEC0 & ~(INT0_ENAB)); IFS0=(IFS0 & ~INT4_ENAB); }while(0)


#define SET_PRIO_SPI1RCV_INTER(prio,subprio) do{ if((prio<=7u)&&(subprio<=3u)) {IPC5=(((IPC5 & PRIO_IO_MASK) | (prio<<26u)) | (subprio<<24u));} }while(0)
#define SET_PRIO_ADC1CONV_INTER(prio,subprio) do{ if((prio<=7u)&&(subprio<=3u)) {IPC6=(((IPC6 & PRIO_IO_MASK) | (prio<<26u)) | (subprio<<24u));} }while(0)
#define SET_PRIO_SPI2RCV_INTER(prio,subprio) do{ if((prio<=7u)&&(subprio<=3u)) {IPC7=(((IPC7 & PRIO_IO_MASK) | (prio<<26u)) | (subprio<<24u));} }while(0)
#define SET_PRIO_RTCC_INTER(prio,subprio) do{ if((prio<=7u)&&(subprio<=3u)) {IPC8=(((IPC8 & PRIO_IO_MASK) | (prio<<26u)) | (subprio<<24u));} }while(0)
#define SET_PRIO_DMA3_INTER(prio,subprio) do{ if((prio<=7u)&&(subprio<=3u)) {IPC9=(((IPC9 & PRIO_IO_MASK) | (prio<<26u)) | (subprio<<24u));} }while(0)
#define SET_PRIO_DMA7_INTER(prio,subprio) do{ if((prio<=7u)&&(subprio<=3u)) {IPC10=(((IPC10 & PRIO_IO_MASK) | (prio<<26u)) | (subprio<<24u));} }while(0)
#define SET_PRIO_CAN2_INTER(prio,subprio) do{ if((prio<=7u)&&(subprio<=3u)) {IPC11=(((IPC11 & PRIO_IO_MASK) | (prio<<26u)) | (subprio<<24u));} }while(0)
#define SET_PRIO_UART5_INTER(prio,subprio) do{ if((prio<=7u)&&(subprio<=3u)) {IPC12=(((IPC12 & PRIO_IO_MASK) | (prio<<26u)) | (subprio<<24u));} }while(0)
// IPC0,12 are the interrupt priority SFRs
// IEC0,1,2 are 32 bit configurations to set the interrupts
// IFS0,1,2 are 32 bit representations of there state triggers

#define DINPORT1 PORTA                                                          // We will assign PORTA to DIN
#if defined(ENCODER_HELPER)                                                     // encoder is using PORTA and PORTB as 10 motor encoder inputs
#define DINPORT2 PORTB
#else
#define AINPORT1 PORTB                                                          // We will assing PORTB to the AIN
#endif
#if ((defined(SBGC_GIMBAL_JOY) || defined(SBGC_GIMBAL_HMI)) || defined(BATCH_MIXER))   // joystick and HMI have analog inputs for control values to be set
#define IOCONFIG 0xFFC0u                                                        // Port B 0-5 ANI (Analog) 6-15 (Digital Change Notification Pins CN Interrupt )
#else
#define IOCONFIG 0xFFFFu                                                        // All Banks digital
#endif
#if defined(SBGC_GIMBAL_JOY)
#define DOTPORT1 LATC                                                           // PORTC We will assign PORTC to the 1st DOT bank used in Joystick
#endif
#if (defined(SBGC_GIMBAL_HMI) || defined(EXTENDED_ARM))
#define DOTPORT2 LATD                                                           // We Wiill assign PORTD to 2nd DOT bank used in ComGS
#endif
#define DINPORT3 PORTE                                                          // we shall assign PORTE as an extra Digital input port
#define DOTPORT3 LATF                                                           // PORTF
#define DINPORT4 PORTG                                                          // PORTG

#define DINTRIS1 TRISA                                                          // We will assign TRISA to DIN
#define INVDIN1 LATAINV                                                         // this word defines which inputs on portA (rail1) are inverted
#if defined(ENCODER_HELPER)
#define DINTRIS2 TRISB
#define INVDIN2 LATBINV                                                         // this word defines which inputs on portB (rail2) are inverted
#else
#define AINTRIS1 TRISB                                                          // We will assing TRISB to the AIN
#endif
#define DOTTRIS1 TRISC                                                          // We will assign TRISC to the 1st DOT bank
#define INVDOT1 LATCINV
#define DOT1ODRAIN ODCCSET
#define DOTTRIS2 TRISD                                                          // We Wiill assign TRISD to 2nd DOT bank
#define INVDOT2 LATDINV
#define DOT2ODRAIN ODCDSET
#define DINTRIS3 TRISE                                                          // We will assign TRISE to 3rd DIN bank used by extended arm
#define INVDIN3 LATEINV                                                         // this word defines which inputs on portE (rail3) are inverted
#define DOTTRIS3 TRISF                                                          // We will assign TRISF to 3rd DOT bank used by extended arm
#define INVDOT3 LATFINV
#define DOT3ODRAIN ODCFSET
#define DINTRIS4 TRISG
#define INVDIN4 LATGINV
#define CN_PULL_UP_CONFIG CNPUE                                                 /* set the bit to true to activate internal pull up resistor on CN6-CN18 inputs on PORTB */
#define ESD_INPUT_PU1 (1u<<6u)                                                  /* example safety cut out which needs pull up resistor on input CN6 */
#define ESD_INPUT_PU2 (1u<<7u)                                                  /* example safety cut out which needs pull up resistor on input CN7 */

#if defined(USE_MAVLINK)                                                        // apply macro to set the relays from a mavlink command
#define MAV_SET_RELAY(x) do{ if (x<=7u) {PORTC = PORTC | (1u<<x);} else if (x<=15u) {PORTD = PORTD | (1u<<x);} else { PORTC=0x0Fu; PORTD=0x0Fu; } }while(0)
#define MAV_CLR_RELAY(x) do{ if (x<=7u) {PORTC = PORTC & ~(1u<<x);} else if (x<=15u) {PORTD = PORTD & ~(1u<<x);} else { PORTC=0u; PORTD=0u; } }while(0)
#define MAV_SET_BANK(x) do{ if (x==1u) {PORTC = PORTC | (x & 0x0Fu);} else if (x==2u) {PORTD = PORTD | (x & 0x0Fu);} else if  (x==3u) {PORTC = PORTC & ~(x & 0x0Fu);} else if (x-=4u) {PORTD = PORTD & ~(x & 0x0Fu);} else { PORTC=0x0Fu; PORTD=0x0Fu; } }while(0)
#define MAV_UNIT_OP1_SEQ_STEP(x) do{ if (x==1u) { PORTC = 0b11110000; PORTD = 0b00001111; } else if (x==2u) { PORTC = 0b01010101; PORTD = 0b10101010; } else if (x==3u) { PORTC = 0b11001100; PORTD = 0b01010101; } else { PORTC = 0b10101111; PORTD = 0b11000011; } }while(0)
#define MAV_UNIT_OP2_SEQ_STEP(x) do{ if (x==1u) { PORTC = 0b11010100; PORTD = 0b01101001; } else if (x==2u) { PORTC = 0b01000101; PORTD = 0b11101010; } else if (x==3u) { PORTC = 0b11101100; PORTD = 0b01010111; } else { PORTC = 0b10100111; PORTD = 0b00110011; } }while(0)
#endif

