mark-nick-o/PIC32RobotCameraDroneController/io.h
// Define the digital input switches
#if defined(SBGC_GIMBAL_JOY)
#define di1SpeedAngle DINPORT1.B0                                               // Flag TRUE=Speed  FALSE=Angle
#define di2PosHalt DINPORT1.B1                                                  // Flag command FALSE=active or TRUE=HALT
#define di3Reset DINPORT1.B2                                                    // Issue a Reset to the device.
#define di4RCMode DINPORT1.B3                                                   // Select RC Mode (for speed)
#define di5VCMode DINPORT1.B4                                                   // Select VC Mode  (for speed).
#define di6FastSelect DINPORT1.B5                                               // Select Fast mode for ANGLE or SPEED.
#endif

// Assign the Analog inputs to each axis
#if defined(SBGC_GIMBAL_JOY)
#define X_AXIS_IN 1U                                                            /* define each pin carrying analog signal */
#define Y_AXIS_IN 2U
#define Z_AXIS_IN 3U
#if (((X_AXIS_IN == Y_AXIS_IN) || (Y_AXIS_IN == Z_AXIS_IN)) || (Z_AXIS_IN == X_AXIS_IN))
#error "Each input pin for the pitch,roll,yaw must be independant in the gimbal controller configuration (currently at least 2 pins are the same)"
#endif
#endif

#if defined(BATCH_MIXER)
#define LevelInChan 4U                                                          /* define the pin carrying the analog for the level measurement signal */
#if ((((LevelInChan <= X_AXIS_IN) || (LevelInChan <= Y_AXIS_IN)) || (LevelInChan <= Z_AXIS_IN)) && defined(SBGC_GIMBAL_JOY))
#error "Cannot assign the LevelInChan to the same as one of the gimbal axis on on a pin before it"
#endif
#define BATCH_LEVL_MIN 0.0f
#define BATCH_LEVL_MAX 100.0f                                                   /* tank level maximum level */
#define timedOn DINPORT1.B6                                                     /* assign a spare digital input channel for manual timed override switch for use when level instrument fault */

#if defined(EXTENDED_ARM)
#define extArmEndStop DINPORT3.B1                                               /* extend arm end stop proximity switch at extended end */
#define extArmRevStop DINPORT3.B2                                               /* extend arm end stop proximity switch at retracted end  */
#define extArmMidStop DINPORT3.B0                                               /* extend arm end stop proximity switch at middle position */
#define EXT_ARM_NOT_AT_STOP 0u                                                  /* position of i/o */
#define EXT_ARM_MID_POS 1u
#define EXT_ARM_FULL_POS 2u
#define EXT_ARM_RET_POS 4u
#define EXT_ARM_ERR_POS 3u
#define ARM_START_DLY 30                                                        /* delay time before we check wrong direction sensor as it could start here */
#endif

#define DeviceState DOTPORT3                                                    /* where pneumatic valve control harness is wired, joystick controller uses DOT1 and can be on the same MCU as the batcher system */
#define Valve1Open (1u<<0u)                                                     /* first addition corse air valve */
#define Valve2Open (1u<<1u)                                                     /* first addition fine air valve */
#define Valve3Open (1u<<2u)                                                     /* second addition corse air valve */
#define Valve4Open (1u<<3u)                                                     /* second addition fine air valve */
#define Valve5Open (1u<<4u)                                                     /* dosing sprayer air valve */
#define Mixer1Run (1u<<5u)                                                      /* tank mixer */
#define Vib1Start (1u<<6u)                                                      /* solid mixing vibrator or pneumatic conveying system */
#define batchSpare1 (1u<<7u)                                                    /* batch system spare DOT */
#define AuxDevState DOTPORT2                                                    /* need to mod joystick if in same system */
#define extArmFwd (1u<<4u)                                                      /* extend the arm forwards */
#define extArmRev (1u<<5u)                                                      /* extend the arm in reverse direction */
#define hydLevlUp (1u<<7u)                                                      /* hyraulic level system control up */
#define hydLevlDwn (1u<<6u)                                                     /* hyraulic level system control down */

#define BANK1_IO_ESD_MASK (Mixer1Run | ((Valve1Open | Valve2Open) | (Valve3Open | Valve4Open)))  // selects the bits which constitute the esd trip outputs from bank 1 of relay outs

#endif  /* end batch mixer */

// State Engine Reported to the DOT LED on DOTPORT1
#define JoyReset 0xE1U                                                          // AND to Set bit 1
#define JoyAngle 0xE2U                                                          // AND to set bit 2
#define JoySpeed 0xE4U                                                          // AND to set bit 3
#define JoyOff 0xE8U                                                            // AND to set bit 4
#define JoySend 0xF0U                                                           // AND to set bit 5
#define GSCMotorSend 32U
#define GSCPIDAutotune 64U
#define JoyClear 0xE0U                                                          // AND to Reset the bits 1-5 of the Status word (Joystick)

// State Engine poll requests for data DOT LED on DOTPORT2
#define GetExtAngles 0x2U                                                       // get angles LED DOTPORT2 0
#define GetAngles 0x1U                                                          // get angles ext LED DOTPORT2 1
#define GetRealtime4 0x4U                                                       // get realtime data 4 LED DOTPORT2 2
#define Clear3LED 0xF8U                                                         // clear the 1st 3 LED's on DOTPORT2
#define GSCMenuSend 0x8U                                                        // Menu Command exceute LED
#define GSCAdjvar 0x10U                                                         // Adjust variables execute LED
#define GSCGetvar 0x20U                                                         // Get variables request LED
#define GSCImu 0x40U                                                            // Select IMU request LED
#define GSCProSet 0x80U                                                         // Select Profile and load / save / erase it LED
#define GSCConSet 0x80U                                                         // Share the same LED as above we ran out of spare

#define BTN_STATE_RELEASED 0U                                                   // Push button States
#define BTN_STATE_PRESSED 1U
#define BTN_BOUNCE_THRESHOLD_MS 3UL                                              // interval for button de-bouncer threshold (in multiples of 100ms)

// AD1CON1 bits
#define IO_AD_ENABLE (1ul<<15ul)                                                  // bit to set in AD1CON1 for enable
#define IO_SIDL_ENABLE (1ul<<13ul)                                                // enable stop on IDLE mode for the ADC
#define IO_FORM_SF16 (3ul<<8ul)
#define IO_FORM_F16 (2ul<<8ul)
#define IO_FORM_SI16 (1ul<<8ul)
#define IO_FORM_I16 0ul
#define IO_FORM_SF32 (7ul<<8ul)
#define IO_FORM_F32 (6ul<<8ul)
#define IO_FORM_SI32 (5ul<<8ul)
#define IO_FORM_I32 (4ul<<8ul)
#define IO_FORM_CLRASAM (1ul<<4ul)
#define IO_FORM_ASAM (1ul<<2ul)                                                 /* set this bit true to Use auto sampling. Sampling starts after the last conversion is finished */
#define IO_FORM_MSAM ~(1ul<<2ul)                                                /* set this bit false to Use manual sampling. Sampling begins when the user sets AD1CON1bits.SAMP. */
/* 1=The SHA is sampling 0=The SHA is holding. */
#define IO_FORM_SAMP (1ul<<1ul)                                                 /*  When auto sampling is disabled (AD1CON1bits.ASAM=0), set this bit to initiate sampling. When using manual conversion (AD1CON1bits.SSRC=0) clear this bit to zero to start conversion */
#define IO_FORM_NO_SAMP 0xFFFDUL
#define IO_AD_STATE 0x0001UL                                                    /* and with AD1CON1 to get state 1 The analog-to-digital conversion is finished. or 0 The ADC is either pending or has not begun. */

