mark-nick-o/PIC32RobotCameraDroneController/io.h
#define IO_CH0SB_15 (0b1111<<24)                                                // bits to set in AD1CHS for enable positive input select MUXB
#define IO_CH0SB_14 (0b1110<<24)                                                // bits to set in AD1CHS for enable
#define IO_CH0SB_13 (0b1101<<24)                                                // bits to set in AD1CHS for enable
#define IO_CH0SB_12 (0b1100<<24)                                                // bits to set in AD1CHS for enable
#define IO_CH0SB_11 (0b1011<<24)                                                // bits to set in AD1CHS for enable
#define IO_CH0SB_10 (0b1010<<24)                                                // bits to set in AD1CHS for enable
#define IO_CH0SB_9 (0b1001<<24)                                                 // bits to set in AD1CHS for enable
#define IO_CH0SB_8 (0b1000<<24)                                                 // bits to set in AD1CHS for enable
#define IO_CH0SB_7 (0b0111<<24)                                                 // bits to set in AD1CHS for enable
#define IO_CH0SB_6 (0b0110<<24)                                                 // bits to set in AD1CHS for enable
#define IO_CH0SB_5 (0b0101<<24)                                                 // bits to set in AD1CHS for enable
#define IO_CH0SB_4 (0b0100<<24)                                                 // bits to set in AD1CHS for enable
#define IO_CH0SB_3 (0b0011<<24)                                                 // bits to set in AD1CHS for enable
#define IO_CH0SB_2 (0b0010<<24)                                                 // bits to set in AD1CHS for enable
#define IO_CH0SB_1 (0b1001<<24)                                                 // bits to set in AD1CHS for enable
#define IO_CH0SB_0 0                                                            // bits to set in AD1CHS for enable

/* AD1CON2 settings (rest as default) choose the analog volt positive and negative and set to scan according to AD1CSSL word */
#define ANI_VOLT_INT_REF_0V do{ AD1CON2=((AD1CON2 & (0b000<<13u)) | (1u<<10u)); }while(0)     /* Use the internal references:VREFH is 3.3 V and VREFL is 0 V */
#define ANI_VOLT_EXT_REF_0V do{ AD1CON2=(((AD1CON2 & (0b000<<13u)) | (0b001<<13u)) | (1u<<10u)); }while(0) /* Use an external referencefor VREFH and an internal referencefor VREFL: VREFH is the voltage on the VREF+ pin and VREFL is 0 V. */
#define ANI_VOLT_INT_REF do{ AD1CON2=(((AD1CON2 & (0b000<<13u)) | (0b010<<13u)) | (1u<<10u)); }while(0)  /* Use an internal referencefor VREFH and an external referencefor VREFL: VREFH is 3.3 V and VREFL is the voltage on the VREF- pin */
#define ANI_VOLT_EXT_REF do{ AD1CON2=(((AD1CON2 & (0b000<<13u)) | (0b011<<13u)) | (1u<<10u)); }while(0)  /* Use external references:VREFH is the voltage on the VREF+ pin and VREFL is the voltage on the VREF- pin */

// AD1CON3 timing of the ADC minimum tad_ns = 75 ns
#define AIN_TAD_NS(tad_ns)  (tad_ns / 25u)-1u                                   /* calculates the ADCS from the tad in ns min val is 75 */
#define AIN_TAD_SAM 5u                                                          /* ADC sample frequency in multiples of the above tads */

// ADCHS1 settings
#define SET_INVERT_ADC do{ AD1CHS=((1u<<23u) | AD1CHS); }while(0)               /* when set The negative input is the pin AN1. */
#define CLR_INVERT_ADC do{ AD1CHS=(~(1u<<23u) & AD1CHS); }while(0)              /* when clear instruction is issued The negative input is VREFL. (normal) */
#define IO_CH0SA_PIN(pin) do{ AD1CHS=((AD1CHS & ~(0b1111<<16u)) | (pin<<16u));   }while(0)   /* pin number 1-15 AD1CHS for enable */

#if (AIN_ADC_METHOD == ADC_MAN_COLLECT)
#if defined(SBGC_GIMBAL_JOY)                                                    /* rule is that gimbal io comes first */
#if ((Z_AXIS_IN < Y_AXIS_IN) && (Z_AXIS_IN < X_AXIS_IN))
#define START_MAN_AIN_PIN Z_AXIS_IN                                             /* z axis is start of the manual sampling AIN pin (gimbal is first) */
#elif ((Y_AXIS_IN < X_AXIS_IN) && (Y_AXIS_IN < Z_AXIS_IN))
#define START_MAN_AIN_PIN Y_AXIS_IN                                             /* y axis start of the manual sampling AIN pin (gimbal is first) */
#else
#define START_MAN_AIN_PIN X_AXIS_IN                                             /* x axis start of the manual sampling AIN pin (gimbal is first) */
#endif /* end choose pin order */
#else
#define START_MAN_AIN_PIN LevelInChan
#endif /* end choose feature */
#endif /* end choose method */

#if ((AIN_ADC_METHOD == ADC_AUTO_COLLECT) || (AIN_ADC_METHOD == ADC_MAN_COLLECT))
#if (defined(SBGC_GIMBAL_JOY) && defined(BATCH_MIXER))
#define NUM_OF_AINS 4u                                                          /* number of consequtive AINs to read */
#elif defined(BATCH_MIXER)
#define NUM_OF_AINS 1u
#elif defined(SBGC_GIMBAL_JOY)
#define NUM_OF_AINS 3u
#endif /* end of function enable count */
#endif /* end of adc method branch */

#define go_left (1u<<0u)                                                        /* defintions of craft movement digital outputs */
#define go_right (1u<<1u)
#define reverse_LR (1u<<2u)
#define go_fwd (1u<<0u)
#define go_back (1u<<1u)
#define reverse_FB (1u<<2u)

// macros to drive I/O
#define SET_DOT_BIT_ON(PORT_BYTE,BITNO)  do ( PORT_BYTE |=  (1u<<BITNO) } while(0)
#define SET_DOT_BIT_OFF(PORT_BYTE,BITNO) do ( PORT_BYTE &= ~(1u<<BITNO) } while(0)
#define SET_DOT_BIT_TOGGLE(PORT_BYTE,BITNO) do ( PORT_BYTE ^=  (1u<<BITNO) } while(0)

// Choose Oscillator
#define IO_FRC_OSC 0                                                            // internal fast RC oscillator
#define IO_FRCPLL_OSC 0b1                                                       // FRC PLL OSC
#define IO_PO_OSC 0b01                                                          // PO OSC
#define IO_POPLL_OSC 0b11                                                       // PO PLL OSC
#define IO_SOSC_OSC 0b100                                                       // SO OSC
#define IO_LPRC_OSC 0b101                                                       // LPRC OSC
#define IO_FRC16_OSC 0b110                                                      // FRC div by 16 OSC
#define IO_FRCDIV_OSC 0b111                                                     // FRC div by FRCDIV bits

#define RAW_MAX 1024u                                                            // 10 bit ADC maxiumum raw counts

typedef struct {
        uint8_t  state;                                                         // current state
        uint8_t trigger_state;                                                  // de-bounced state
        uint64_t last_time_ms;                                                  // Time out of the latch
} IO_btn_state_t;                                                               // This is a debounced button type for a DI key press

/* --------------- function definitions ------------------------------------- */

#ifdef __cplusplus
}
#endif /* __cplusplus */

#endif